Revit 2023 API
GroupTypeId.Mechanical Property
 "Mechanical"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId Mechanical { get; }
Visual Basic
Public Shared ReadOnly Property Mechanical As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Mechanical {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace